using the dataset we are predicting FIRE_SIZE_CLASS using predictors,"FIRE_YEAR","DISCOVERY_TIME","Days_to_extinguish_fire","CONT_TIME","FIRE_SIZE"

In [ ]:
#importing the packages required to start
import pandas as pd
import numpy as np
import sklearn

In [ ]:
#importing the data from excel file in python usinfg pandas
data=pd.read_excel("/content/Us Fire Data.xlsx")

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78512 entries, 0 to 78511
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   FIRE_YEAR                78512 non-null  int64
 1   Fire_Date                78512 non-null  datetime64[ns]
 2   DISCOVERY_TIME           78512 non-null  int64
 3   STAT_CAUSE_DESCR         78512 non-null  object
 4   Days_to_extinguish_fire  78512 non-null  int64
 5   CONT_TIME                78512 non-null  int64
 6   FIRE_SIZE                78512 non-null  float64
 7   FIRE_SIZE_CLASS          78512 non-null  object
 8   LATITUDE                 78512 non-null  float64
 9   LONGITUDE                78512 non-null  float64
 10  STATE                    78512 non-null  object
 11  FIPS_CODE                78512 non-null  int64
 12  FIPS_NAME                78512 non-null  object
dtypes: datetime64[ns](1), float64(3), int64(5), object(4)
memory usage: 7.8+ MB

In [ ]:
data.head()

   FIRE_YEAR  Fire_Date  DISCOVERY_TIME  ... STATE  FIPS_CODE  FIPS_NAME
0       2015 2015-12-26            1009  ...    NY         87   Rockland
1       2015 2015-12-11            1230  ...    OR         39       Lane
2       2015 2015-12-11            1355  ...    OR         39       Lane
3       2015 2015-12-11            1551  ...    NY         55     Monroe
4       2015 2015-12-09            1830  ...    NY         53    Madison

[5 rows x 13 columns]

In [ ]:
data.tail()

       FIRE_YEAR  Fire_Date  DISCOVERY_TIME  ... STATE  FIPS_CODE  FIPS_NAME
78507       2005 2005-02-11            1342  ...    NY         47      Kings
78508       2005 2005-02-04            2322  ...    NY        103    Suffolk
78509       2005 2005-01-06            1730  ...    UT          1     Beaver
78510       2005 2005-01-02            2117  ...    NY         85   Richmond
78511       2005 2005-01-01            1434  ...    NY         85   Richmond

[5 rows x 13 columns]

In [ ]:
#analysis report on our dataset
import pandas_profiling as pp
pp.ProfileReport(data)

In [ ]:
#Dropping Columns which are highy correlated and not needed
new_data=data.drop(["Fire_Date","STAT_CAUSE_DESCR","LATITUDE","LONGITUDE","STATE","FIPS_CODE","FIPS_NAME"],axis=1)

In [ ]:
new_data.head()

   FIRE_YEAR  DISCOVERY_TIME  ...  FIRE_SIZE  FIRE_SIZE_CLASS
0       2015            1009  ...        0.1                A
1       2015            1230  ...        0.1                A
2       2015            1355  ...        0.1                A
3       2015            1551  ...        0.1                A
4       2015            1830  ...        0.1                A

[5 rows x 6 columns]

In [ ]:
new_data["FIRE_SIZE_CLASS"].unique()

array(['A', 'B', 'C', 'D', 'E', 'G', 'F'], dtype=object)

In [ ]:
#Replacing Categorical Values in FIRE_SIZE_CLASS Column with dummies using map
new_data['FIRE_SIZE_CLASS']=new_data.FIRE_SIZE_CLASS.map({'A':0,'B':1,'C':2,'D':3,'E':4,'G':5,'F':6})

In [ ]:
new_data.head()

   FIRE_YEAR  DISCOVERY_TIME  ...  FIRE_SIZE  FIRE_SIZE_CLASS
0       2015            1009  ...        0.1                0
1       2015            1230  ...        0.1                0
2       2015            1355  ...        0.1                0
3       2015            1551  ...        0.1                0
4       2015            1830  ...        0.1                0

[5 rows x 6 columns]

In [ ]:
#Assigning X,y Values
X=new_data.drop(["FIRE_SIZE_CLASS"],axis=1)

In [ ]:
y=new_data["FIRE_SIZE_CLASS"]

# Applying Decision Tree Classifier

In [ ]:
#importing train_test_split method to split data into train & test
from sklearn.model_selection import train_test_split

In [ ]:
#splitting data into train & test with 70% as train data and 30% as test data
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.30,random_state=5)

In [ ]:
#Importing the Algorithm 
from sklearn.tree import DecisionTreeClassifier

In [ ]:
#Activating the model
Model=DecisionTreeClassifier()

In [ ]:
#training the model with X_train and y_train data
Model.fit(X_train,y_train)

DecisionTreeClassifier()

In [ ]:
#Predicting from the model by giving X_test data
prediction=Model.predict(X_test)

# Model Accuracy

In [ ]:
#Checking the model accuracy by classification report and confusion matrix
#importing metrics
from sklearn.metrics import classification_report,confusion_matrix

In [ ]:
print(classification_report(y_test,prediction))

              precision    recall  f1-score   support

           0       1.00      1.00      1.00     13670
           1       1.00      1.00      1.00      6565
           2       1.00      1.00      1.00      1896
           3       1.00      1.00      1.00       476
           4       1.00      1.00      1.00       367
           5       1.00      1.00      1.00       237
           6       1.00      1.00      1.00       343

    accuracy                           1.00     23554
   macro avg       1.00      1.00      1.00     23554
weighted avg       1.00      1.00      1.00     23554

In [ ]:
confusion_matrix(y_test,prediction)

array([[13670,     0,     0,     0,     0,     0,     0],
       [    0,  6565,     0,     0,     0,     0,     0],
       [    0,     0,  1896,     0,     0,     0,     0],
       [    0,     0,     0,   476,     0,     0,     0],
       [    0,     0,     0,     0,   367,     0,     0],
       [    0,     0,     0,     0,     0,   237,     0],
       [    0,     0,     0,     0,     0,     0,   343]], dtype=int64)

In [ ]:
X

,FIRE_YEAR,DISCOVERY_TIME,Days_to_extinguish_fire,CONT_TIME,FIRE_SIZE
0,2015,1009,0,1025,0.1
1,2015,1230,0,1415,0.1
2,2015,1355,0,1510,0.1
3,2015,1551,0,1603,0.1
4,2015,1830,0,1855,0.1
...,...,...,...,...,...
78507,2005,1342,0,1342,0.1
78508,2005,2322,0,2322,0.1
78509,2005,1730,0,1800,0.1
78510,2005,2117,0,2117,0.1
78511,2005,1434,0,1434,0.1